/*
 Localizable.strings
 Gmail Notifr

 Created by James Chen on 8/4/09.
 Copyright 2009 ashchan.com. All rights reserved.
 
 Contributors: Olli <ollinpostit@gmail.com>
 */


//-----------------------------------------
// Menu and tooltip
//----------------------------------------
/* Open Inbox menu item under each account */
"Open Inbox" = "Avaa postilaatikko";

/* menubar tooltip when checking mail */
"Checking Mail" = "Tarkistetaan...";

/* connection error message */
"Connection Error" = "Yhteysvirhe";

/* wrong username/password pair error message */
"Username/password Wrong" = "Väärä käyttäjätunnus tai salasana";

/* count of unread messages */
"Unread Messages" = "%d lukematon viesti";

/* count (1) of unread message */
"Unread Message" = "%d lukematonta viestiä";

/* last check time */
"Last Checked:" = "Viimeksi tarkistettu:";

/* Enable, Disable */
"Enable Account" = "Ota tili käyttöön";
"Disable Account" = "Poista tili käytöstä";

/* Check */
"Check" = "Tarkista";

/* Main Menu */
"Check All" = "Tarkista kaikki";
"Preferences..." = "Asetukset...";
"Check for Updates..." = "Tarkista päivitykset...";
"About Gmail Notifr" = "Tietoja Mail Notifr'stä";
"Donate..." = "Lahjoita...";
"Rate on App Store" = "Arvostele App Storessa...";
"Quit Gmail Notifr" = "Sulje Mail Notifr";


//-----------------------------------------
// Preferences - Settings
// ----------------------------------------
"Settings" = "Asetukset";
"Launch at login" = "Käynnistä kirjautumisen yhteydessä";
"Show unread count in menu bar" = "Näytä lukemattomien viestien määrä valikkopalkissa";
"shortcuts.label" = "Pikanäppäimet";
"shortcuts.checkall.label" = "Tarkista kaikki:";


//-----------------------------------------
// Preferences - Accounts
// ----------------------------------------
"Accounts" = "Tilit";
"Edit" = "Muokkaa";

"Username:" = "Käyttäjätunnus:";
"Password:" = "Salasana:";
"Check for new mail every" = "Tarkista uudet viestit";
"minutes" = "min välein";
"Use Growl Notification" = "Näytä ilmoitus";
"Play sound:" = "Toista ääni:";
"To add a Google Hosted Account, specify the full email address as username, eg: admin@ashchan.com." = "Jos haluat käyttää Google Hosted -tiliä, kirjoita käyttäjätunnukseksi koko sähköpostiosoite, esimerkiksi james@ashchan.com.";
"Enable this account" = "Ota tämä tili käyttöön";
"Open in browser:" = "Avaa selaimessa:";
"Cancel" = "Peruuta";
"OK" = "OK";
